FemDesign.Geometry.CoordinateSystem.#ctor
Parameterless constructor for serialization.

FemDesign.Geometry.CoordinateSystem.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d)
Construct FdCoordinateSystem from origin point and local x and y axes.

FemDesign.Geometry.CoordinateSystem.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d)
Construct FdCoordinateSystem from origin point and local x, y, z axes.

FemDesign.Geometry.CoordinateSystem.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d)
Construct FdCoordinateSystem from three points. localX will follow the point1 - point0 direction.

FemDesign.Geometry.CoordinateSystem.Global
Global coordinate system

FemDesign.Geometry.CoordinateSystem.IsComplete
Check if this coordinate system is complete.
Returns:

FemDesign.Geometry.CoordinateSystem.IsOrthogonal
Check if this coordinate system is orthogonal within the tolernace.
Returns:

FemDesign.Geometry.CoordinateSystem.SetXAroundZ(FemDesign.Geometry.Vector3d)
Set X-axis and rotate coordinate system accordingly around Z-axis.

FemDesign.Geometry.CoordinateSystem.SetYAroundX(FemDesign.Geometry.Vector3d)
Set Y-axis and rotate coordinate system accordingly around X-Axis.

FemDesign.Geometry.CoordinateSystem.SetYAroundZ(FemDesign.Geometry.Vector3d)
Set Y-axis and rotate coordinate system accordingly around Z-axis

FemDesign.Geometry.CoordinateSystem.SetZAroundX(FemDesign.Geometry.Vector3d)
Set Z-axis and rotate coordinate system accordingly around X-axis

FemDesign.Geometry.CoordinateSystem.OrientEdgeTypeLcsToGcs
Orient this coordinate system to GCS as if this coordinate system was constrained as an edge (i.e x' is constrained by the edge)

FemDesign.Geometry.CoordinateSystem.OrientPlaneTypeLcsToGcs
Orient this coordinate system to GCS as if this coordinate system was constrained as a plane (i.e. x' and y' are constrianed by the plane)
If plane is not vertical plane z' will be orientated up.
If plane is vertical y' will be orientated up.

FemDesign.Geometry.CoordinateSystem.op_Implicit(FemDesign.Geometry.Point3d)~FemDesign.Geometry.CoordinateSystem
Implicity convert FdPoint to a FdCoordinateSystem. Local axis are set to Global X and Global Y.
point: